---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RevitLinkUIUtils Members
RevitLinkUIUtils Class Methods See Also Send Feedback
---

The RevitLinkUIUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | ReportLinkLoadResults | This function reports any errors which were encountered when loading the Revit links represented by the given LinkLoadResult map. |

# See Also

RevitLinkUIUtils Class

Autodesk.Revit.UI Namespace